#!/usr/bin/env python3
# -*- coding:utf-8 -*-


#FindDepartment科別查詢用字典
departmentDICT = {
    "耳鼻喉科": ["顎", "耳朵", "鼻子", "鼻", "咽喉", "鼻涕", "喉嚨", "脖子", "耳", "鼻樑", "鼻腔內", "耳鼻喉", "鼻炎", "打呼", "打鼾", "扁桃腺", "流鼻血", "過敏性鼻炎"],
    "家醫科": ["喉部", "頸椎", "嘴", "風池穴", "小腿", "臉頰", "屁股", "眉間", "頭", "頸部", "腹瀉", "家醫", "頭痛", "頭暈", "咳嗽", "噁心", "小拇指", "下背", "發燒", "疲勞", "疲倦", "暈眩", "背", "累","臂"],
    "腸胃科": ["肚子", "腸胃", "胃"],
    "婦產科": ["陰部", "婦產", "乳房", "乳腺", "陰道"],
    "一般內科": ["腹", "高血壓", "黃疸", "一般內科"],
    "心臟內科": ["心臟", "瓣膜", "心", "心導管手術", "心跳", "心臟內"],
    "胸腔外科": ["胸口", "胸"],
    "眼科": ["眼睛", "飛蚊症", "眼"],
    "泌尿科": ["泌尿", "小便", "尿"],
    "內分泌科": ["賀爾蒙"],
    "神經內科": ["神經內", "麻痺"],
    "胸腔內科": ["胸腔內"],
    "牙科": ["牙齒"],
    "皮膚科":["掉頭髮","皮膚","脂肪瘤","痘痘", "禿"],
    "身心科":["心情","睡眠", "瘋", "身心"],
    "骨科":["骨", "骨頭"],
    "外科" : ["外"],
    "急診":["急診"],
    "感染科":["感染"],
    "消化內科":["消化內"],
    "老人醫學科":["老人醫學"],
    "整形外科" : ["整形外"] 
    }
#FindDepartment危急情況字典
emergencyLIST = ["大量出血","昏迷","失去意識","沒有心跳","血流不止","停止呼吸", "暈倒"]
otherLIST = ["狗", "貓", "鳥", "鼠"]